/* 
   Localizable.strings
   Proxly

   Created for localization support.
*/

// MARK: - Defaults
"defaults.new_rule_name" = "Neue Regel";

// MARK: - Tab Navigation
"tab.rules" = "Regeln";
"tab.settings" = "Einstellungen";
"tab.about" = "Über";

// MARK: - General UI
"window.title.settings" = "Proxly-Einstellungen";
"button.add_rule" = "Regel hinzufügen";
"button.save" = "Speichern";
"button.cancel" = "Abbrechen";
"button.delete" = "Löschen";
"button.ok" = "OK";
"button.open_system_preferences" = "Systemeinstellungen öffnen";

// MARK: - Settings View
"settings.title" = "Einstellungen";
"settings.section.general" = "Allgemein";
"settings.section.default_behavior" = "Standardverhalten";
"settings.section.logging" = "Protokollierung";

"settings.enable_rules.title" = "Regeln aktivieren";
"settings.enable_rules.subtitle.enabled" = "Regeln sind aktiv";
"settings.enable_rules.subtitle.disabled" = "⚠️ Alle Regeln werden ignoriert!";

"settings.launch_at_login.title" = "Beim Anmelden starten";
"settings.launch_at_login.subtitle" = "Proxly automatisch starten, wenn Sie sich bei Ihrem Mac anmelden";

"settings.when_no_rule_matches" = "Wenn keine Regel übereinstimmt:";
"settings.default_behavior.show_selection" = "Browserauswahl anzeigen";
"settings.default_behavior.open_fallback" = "Fallback-Browser öffnen";

"settings.fallback_browser.title" = "Fallback-Browser";
"settings.fallback_browser.subtitle" = "Wird verwendet, wenn keine Regel übereinstimmt und 'Fallback-Browser öffnen' ausgewählt ist";

"settings.notify_fallback.title" = "Benachrichtigung anzeigen, wenn der Fallback-Browser verwendet wird";
"settings.notify_fallback.subtitle" = "Benachrichtigt werden, wenn eine URL mit dem Fallback-Browser geöffnet wird";

"settings.tooltips.title" = "Tooltips anzeigen";
"settings.tooltips.subtitle" = "Hilfreiche Hinweise beim Überfahren von Bedienelementen anzeigen";
"settings.tooltips.enable_rules" = "Aktivieren oder deaktivieren Sie alle Browser-Routing-Regeln. Wenn deaktiviert, werden alle Regeln ignoriert und das Standardverhalten wird verwendet.";
"settings.tooltips.launch_at_login" = "Wenn aktiviert, startet Proxly automatisch beim Anmelden an Ihrem Mac und stellt sicher, dass Ihre Regeln immer aktiv sind.";
"settings.tooltips.default_behavior" = "Wählen Sie, was passiert, wenn keine Regel mit einer URL übereinstimmt: entweder Browser-Auswahldialog anzeigen oder automatisch mit Fallback-Browser öffnen.";
"settings.tooltips.fallback_browser" = "Wählen Sie, welcher Browser als Fallback verwendet werden soll, wenn keine Regel übereinstimmt und die Fallback-Option ausgewählt ist.";
"settings.tooltips.notify_fallback" = "Wenn aktiviert, erhalten Sie eine Benachrichtigung, wenn eine URL mit dem Fallback-Browser geöffnet wird.";
"settings.tooltips.enable_logging" = "Aktivieren Sie die Protokollierung, um bei der Diagnose von Problemen zu helfen. Proxly protokolliert geöffnete URLs und Diagnosemeldungen. Es werden keine persönlichen Daten gesammelt.";
"settings.tooltips.show_tooltips" = "Schalten Sie diese Einstellung um, um hilfreiche Tooltips beim Überfahren von Bedienelementen anzuzeigen oder zu verbergen.";

"settings.logging.enable" = "Protokollierung aktivieren";
"settings.logging.subtitle" = "Wenn eingeschaltet, protokolliert Proxly geöffnete URLs und Diagnosemeldungen. Es werden keine Daten gesammelt.";

// MARK: - Notifications
"notification.permission.title" = "Benachrichtigungsberechtigung erforderlich";
"notification.permission.message" = "Proxly benötigt die Berechtigung, Benachrichtigungen zu senden. Bitte aktivieren Sie Benachrichtigungen in den Systemeinstellungen.";
"notification.denied.title" = "Benachrichtigungen verweigert";
"notification.denied.message" = "Sie haben die Benachrichtigungsberechtigungen zuvor verweigert. Bitte aktivieren Sie Benachrichtigungen in den Systemeinstellungen, wenn Sie Benachrichtigungen erhalten möchten.";
"notification.fallback.title" = "Fallback-Browser verwendet";
"notification.fallback.body" = "URL im Fallback-Browser geöffnet: %@";

// MARK: - Rules View
"rules.title" = "Regeln";
"rules.status.enabled" = "Aktiviert";
"rules.status.disabled" = "Deaktiviert";
"rules.empty.title" = "Noch keine Regeln";
"rules.empty.subtitle" = "Erstellen Sie Ihre erste Regel, um URLs intelligent weiterzuleiten";
"rules.empty.description" = "Mit Regeln können Sie verschiedene Websites basierend auf Domains, Fokusmodi oder Tageszeit automatisch in bestimmten Browsern öffnen.";
"rules.select.title" = "Wählen Sie eine Regel aus";
"rules.select.subtitle" = "Wählen Sie eine Regel aus der Liste aus, um deren Details anzuzeigen und zu bearbeiten";
"rules.priority.title" = "Priorität";

// MARK: - Rule Edit View
"rule.edit.title.new" = "Regel hinzufügen";
"rule.edit.title.edit" = "Regel bearbeiten";
"rule.edit.name.placeholder" = "Regelnamen eingeben";
"rule.edit.name.empty" = "Regelname darf nicht leer sein";
"rule.edit.name.valid" = "Regelname ist gültig";
"rule.edit.saved.title" = "Regel gespeichert";
"rule.edit.section.name" = "Name";
"rule.edit.section.type" = "Regeltyp";
"rule.edit.section.condition" = "Bedingung";
"rule.edit.section.browser" = "Zielbrowser";
"rule.edit.section.priority" = "Priorität";

"rule.condition.placeholder" = "z.B. apple.com oder Arbeit";
"rule.validation.empty" = "Bedingung darf nicht leer sein.";
"rule.validation.duplicate" = "Eine Regel mit diesem Typ und dieser Bedingung existiert bereits.";
"rule.validation.valid" = "Bedingung ist gültig";

"rule.priority.title" = "Prioritätsstufe";
"rule.priority.subtitle" = "Regeln mit höherer Priorität werden zuerst ausgewertet";

"rule.delete.title" = "Regel löschen";
"rule.delete.message" = "Sind Sie sicher, dass Sie diese Regel löschen möchten? Diese Aktion kann nicht rückgängig gemacht werden.";

// MARK: - Rule Types
"rule_type.domain" = "Domain";
"rule_type.focus_mode" = "Fokusmodus";
"rule_type.time" = "Zeit";

// MARK: - Time-Based Rules
"time_rule.time.start" = "Startzeit";
"time_rule.time.end" = "Endzeit";
"time_rule.time.section_title" = "Zeitbereich";
"time_rule.time.overnight_warning" = "Diese Regel ist über Nacht aktiv (überschreitet Mitternacht)";
"time_rule.time.active_preview" = "Aktiv von %@ bis %@";

"time_rule.days.section_title" = "Wochentage";
"time_rule.days.weekdays" = "Wochentage";
"time_rule.days.weekends" = "Wochenenden";
"time_rule.days.all_days" = "Alle Tage";
"time_rule.days.clear" = "Löschen";

"time_rule.days.sunday" = "Sonntag";
"time_rule.days.monday" = "Montag";
"time_rule.days.tuesday" = "Dienstag";
"time_rule.days.wednesday" = "Mittwoch";
"time_rule.days.thursday" = "Donnerstag";
"time_rule.days.friday" = "Freitag";
"time_rule.days.saturday" = "Samstag";

"time_rule.days.sun" = "So";
"time_rule.days.mon" = "Mo";
"time_rule.days.tue" = "Di";
"time_rule.days.wed" = "Mi";
"time_rule.days.thu" = "Do";
"time_rule.days.fri" = "Fr";
"time_rule.days.sat" = "Sa";

"time_rule.days.active_on" = "Aktiv an: %@";

"time_rule.preview.title" = "Regel-Vorschau";
"time_rule.preview.summary" = "Aktiv an %@ von %@ bis %@";
"time_rule.preview.every_day" = "Jeden Tag";

"time_rule.validation.invalid_time_range" = "Start- und Endzeit dürfen nicht gleich sein";
"time_rule.validation.no_days_selected" = "Bitte wählen Sie mindestens einen Tag aus";
"time_rule.validation.duplicate_range" = "Dieser Zeitbereich existiert bereits für die ausgewählten Tage";

// MARK: - Browser Selection
"browser_selection.title" = "Wählen Sie einen Browser";
"browser_selection.subtitle" = "Wählen Sie aus, welcher Browser diesen Link öffnen soll";
"browser_selection.url_label" = "Öffnen:";
"browser_selection.remember" = "Diese Auswahl merken";
"browser_selection.action" = "Öffnen";

// MARK: - About View
"about.title" = "Über";
"about.app_subtitle" = "Intelligenter Browser-Chooser";
"about.version" = "Version";
"about.build" = "Build";

"about.section.what_is" = "Was ist Proxly?";
"about.description.main" = "Proxly ist ein intelligenter Browser-Chooser, der Weblinks basierend auf anpassbaren Regeln automatisch an den richtigen Browser weiterleitet.";
"about.description.detail" = "Machen Sie sich nie wieder Sorgen, Arbeitslinks in Ihrem persönlichen Browser zu öffnen oder umgekehrt. Richten Sie Regeln basierend auf Domains, Fokusmodi oder Tageszeit ein und lassen Sie Proxly den Rest erledigen.";

"about.section.features" = "Hauptmerkmale";
"about.feature.domain_rules.title" = "Domain-basierte Regeln";
"about.feature.domain_rules.description" = "Leiten Sie bestimmte Websites an bestimmte Browser weiter";
"about.feature.focus_mode.title" = "Integration des Fokusmodus";
"about.feature.focus_mode.description" = "Unterschiedliche Browser für Arbeit und Freizeit";
"about.feature.time_based.title" = "Zeitbasiertes Routing";
"about.feature.time_based.description" = "Automatische Browserauswahl basierend auf der Tageszeit";
"about.feature.priority.title" = "Prioritätssystem";
"about.feature.priority.description" = "Feinabstimmung der Regelpriorität mit Prioritätsstufen";

"about.feature.menu_bar.title" = "Menüleisten-Integration";
"about.feature.menu_bar.description" = "Schneller Zugriff auf Regeln und Einstellungen über die Menüleiste";

"about.section.developer" = "Entwickler";
"about.developer.name" = "Paweł Mazurkiewicz";
"about.developer.role" = "macOS-Entwickler";
"about.developer.description" = "Schöne, funktionale Apps für den Mac erstellen";

"about.section.links" = "Links & Support";
"about.link.website" = "Webseite";
"about.link.support" = "Unterstützung";
"about.link.support_description" = "Brauchen Sie Unterstützung? Lassen Sie es mich wissen!";
"about.link.feature_request" = "Funktion anfordern";
"about.link.feature_request_description" = "Haben Sie eine Idee für eine neue Funktion? Teilen Sie sie!";
"about.link.rate" = "Proxly im App Store bewerten";
"about.link.rate_description" = "Wenn Ihnen die Nutzung von Proxly gefällt, denken Sie bitte darüber nach, eine Bewertung im App Store zu hinterlassen!";
"about.link.github" = "Quellcode";

// MARK: - Menu Bar
"menu.toggle_rules" = "Regeln umschalten";
"menu.open_settings" = "Einstellungen öffnen...";
"menu.quit" = "Proxly beenden";

// MARK: - Errors
"error.app_not_found" = "Anwendung mit Bundle-ID '%@' nicht gefunden.";
"error.open_failed" = "URL konnte nicht geöffnet werden: %@";

/* Rule List */
"rule_list_title" = "Regeln";
"rule_list_subtitle" = "Verwalten Sie Ihre Browser-Routing-Regeln";
"rule_list_browser" = "Browser";
"rule_list_priority" = "Priorität";

// MARK: - Focus Mode
"focus.app_filter.title" = "App-Fokusfilter";
"focus.app_filter.description" = "App-Verhalten für verschiedene Fokusmodi konfigurieren";
"focus.display_representation.title" = "Fokus: %@";
"focus.display_representation.subtitle" = "Benutzerdefiniertes App-Verhalten für diesen Fokus";
"focus.unnamed" = "Unbenannt";

"focus.status.not_determined" = "Nicht bestimmt";
"focus.status.restricted" = "Eingeschränkt";
"focus.status.denied" = "Verweigert";
"focus.status.authorized" = "Autorisiert";
"focus.status.unknown" = "Unbekannt";

"focus.info.status.active" = "Aktiv";
"focus.info.status.inactive" = "Inaktiv";
"focus.info.authorization" = "Autorisierung";
"focus.info.name" = "Fokusname";
"focus.info.name.not_available" = "Nicht verfügbar (erfordert Benutzereinrichtung)";

// MARK: - Focus Suggestions
"focus.suggestion.work" = "Arbeit";
"focus.suggestion.personal" = "Persönlich";
"focus.suggestion.sleep" = "Schlaf";
"focus.suggestion.do_not_disturb" = "Nicht stören";

// MARK: - Accessibility
"accessibility.section.label" = "Bereich";

// Rule Edit Accessibility
"accessibility.rule_edit.name.label" = "Regel-Name";
"accessibility.rule_edit.name.hint" = "Geben Sie einen beschreibenden Namen für diese Regel ein";

"accessibility.rule_edit.rule_type.section_label" = "Regel-Typ-Auswahl";
"accessibility.rule_edit.rule_type.domain.label" = "Domain-basierte Regel";
"accessibility.rule_edit.rule_type.domain.hint" = "Erstellen Sie eine Regel, die Website-Domains entspricht";
"accessibility.rule_edit.rule_type.focus_mode.label" = "Fokus-Modus-Regel";
"accessibility.rule_edit.rule_type.focus_mode.hint" = "Erstellen Sie eine Regel, die während bestimmter Fokus-Modi aktiviert wird";
"accessibility.rule_edit.rule_type.time.label" = "Zeitbasierte Regel";
"accessibility.rule_edit.rule_type.time.hint" = "Erstellen Sie eine Regel, die zu bestimmten Zeiten und Tagen aktiviert wird";

"accessibility.rule_edit.condition.label" = "Regel-Bedingung";
"accessibility.rule_edit.condition.hint" = "Geben Sie die Bedingung ein, die diese Regel auslöst";
"accessibility.rule_edit.condition.section_label" = "Regel-Bedingung";

"accessibility.rule_edit.browser.section_label" = "Ziel-Browser-Auswahl";
"accessibility.rule_edit.browser.selected_hint" = "Tippen, um einen anderen Browser auszuwählen";
"accessibility.rule_edit.browser.unselected_hint" = "Tippen, um diesen Browser auszuwählen";
"accessibility.rule_edit.browser.selected_label" = "%@ Browser, derzeit ausgewählt";
"accessibility.rule_edit.browser.unselected_label" = "%@ Browser, nicht ausgewählt";

"accessibility.rule_edit.browser_row.selected_label" = "Ausgewählter Browser";
"accessibility.rule_edit.browser_row.unselected_label" = "Verfügbarer Browser";
"accessibility.rule_edit.browser_row.selected_hint" = "Dieser Browser ist derzeit für diese Regel ausgewählt";
"accessibility.rule_edit.browser_row.unselected_hint" = "Tippen, um diesen Browser für diese Regel auszuwählen";

"accessibility.rule_edit.priority.label" = "Regel-Priorität";
"accessibility.rule_edit.priority.hint" = "Passen Sie die Prioritätsstufe für diese Regel an. Regeln mit höherer Priorität haben Vorrang";
"accessibility.rule_edit.priority.section_label" = "Prioritäts-Einstellung";
"accessibility.rule_edit.priority.value_label" = "Prioritätsstufe %d";

"accessibility.rule_edit.button.save.hint" = "Die aktuelle Regel-Konfiguration speichern";
"accessibility.rule_edit.button.save.hint_disabled" = "Füllen Sie alle erforderlichen Felder aus, um die Regel zu speichern";
"accessibility.rule_edit.button.cancel.hint" = "Bearbeitung abbrechen und Änderungen verwerfen";
"accessibility.rule_edit.button.delete.hint" = "Diese Regel dauerhaft löschen";
"accessibility.rule_edit.button.delete.label" = "Regel löschen";

"accessibility.rule_edit.validation.error_label" = "Validierungsfehler";
"accessibility.rule_edit.validation.success_label" = "Validierung erfolgreich";

"accessibility.rule_edit.success.label" = "Regel erfolgreich gespeichert";
"accessibility.rule_edit.success.hint" = "Die Regel wurde gespeichert und ist jetzt aktiv";

// General Accessibility
"accessibility.general.section_header" = "Bereichs-Überschrift";
"accessibility.general.validation_message" = "Validierungs-Nachricht";
"accessibility.general.success_indicator" = "Erfolgs-Indikator";

// Browser Selection Accessibility
"accessibility.browser_selection.row_label" = "Browser-Option";
"accessibility.browser_selection.selected_state" = "Ausgewählt";
"accessibility.browser_selection.unselected_state" = "Nicht ausgewählt";

// Time-Based Rule Accessibility
"accessibility.time_based_rule.time_range.section_label" = "Zeitbereich-Einstellungen";
"accessibility.time_based_rule.time_range.start_time_label" = "Startzeit";
"accessibility.time_based_rule.time_range.end_time_label" = "Endzeit";
"accessibility.time_based_rule.time_range.start_time_hint" = "Stellen Sie die Zeit ein, zu der diese Regel aktiv wird";
"accessibility.time_based_rule.time_range.end_time_hint" = "Stellen Sie die Zeit ein, zu der diese Regel inaktiv wird";

"accessibility.time_based_rule.day_selection.section_label" = "Tage-Auswahl";
"accessibility.time_based_rule.day_selection.day_selected_hint" = "Dieser Tag ist in der Regel enthalten";
"accessibility.time_based_rule.day_selection.day_unselected_hint" = "Tippen, um diesen Tag in die Regel einzuschließen";

"accessibility.time_based_rule.preview.label" = "Regel-Vorschau";
"accessibility.time_based_rule.preview.hint" = "Zusammenfassung, wann diese Regel aktiv sein wird";

"accessibility.time_based_rule.time_range.overnight_warning_label" = "Warnung Nachtbereich: Diese Regel ist über Mitternacht aktiv";
"accessibility.time_based_rule.time_range.preview_label" = "Vorschau des aktiven Zeitbereichs";
"accessibility.time_based_rule.day_selection.day_button_label" = "Tag: %@, Status: %@";
"accessibility.time_based_rule.day_selection.clear_button_label" = "Auswahl löschen";
"accessibility.time_based_rule.day_selection.clear_button_hint" = "Tippen, um alle Wochentage abzuwählen";
"accessibility.time_based_rule.day_selection.preset_button_label" = "Voreinstellung: %@, Status: %@";
"accessibility.time_based_rule.day_selection.preset_button_hint" = "Tippen, um eine Tagesvoreinstellung wie Wochentage oder Wochenenden anzuwenden";
"accessibility.time_based_rule.day_selection.selected_days_preview_label" = "Vorschau der ausgewählten Tage";

// MARK: - Accessibility Strings for Settings
"accessibility.settings.toolbar.title.label" = "Proxly Einstellungen";
"accessibility.settings.toolbar.title.hint" = "Haupteinstellungsseite für die Proxly-App-Konfiguration";

// Settings - General Section
"accessibility.settings.general.section_label" = "Allgemeine Einstellungen Bereich";
"accessibility.settings.general.enable_rules.label" = "Regeln aktivieren Umschalter";
"accessibility.settings.general.enable_rules.hint" = "Wenn aktiviert, sind alle Regeln aktiv. Wenn deaktiviert, werden alle Regeln ignoriert";
"accessibility.settings.general.enable_rules.value.enabled" = "Regeln sind aktiviert";
"accessibility.settings.general.enable_rules.value.disabled" = "Regeln sind deaktiviert";
"accessibility.settings.general.launch_at_login.label" = "Beim Anmelden starten Umschalter";
"accessibility.settings.general.launch_at_login.hint" = "Wenn aktiviert, startet Proxly automatisch beim Anmelden an Ihrem Mac";
"accessibility.settings.general.launch_at_login.value.enabled" = "Beim Anmelden starten ist aktiviert";
"accessibility.settings.general.launch_at_login.value.disabled" = "Beim Anmelden starten ist deaktiviert";

// Settings - Default Behavior Section
"accessibility.settings.default_behavior.section_label" = "Standard-Verhalten Einstellungen Bereich";
"accessibility.settings.default_behavior.picker.label" = "Standard-Verhalten Auswahl";
"accessibility.settings.default_behavior.picker.hint" = "Wählen Sie, was passiert, wenn keine Regel einer URL entspricht. Entweder Browser-Auswahl anzeigen oder Fallback-Browser öffnen";
"accessibility.settings.default_behavior.picker.value" = "Derzeit eingestellt auf %@";
"accessibility.settings.fallback_browser.picker.label" = "Fallback-Browser Auswahl";
"accessibility.settings.fallback_browser.picker.hint" = "Wählen Sie, welcher Browser als Fallback verwendet werden soll, wenn keine Regel entspricht und die Fallback-Option ausgewählt ist";
"accessibility.settings.fallback_browser.picker.value" = "Derzeit eingestellt auf %@";
"accessibility.settings.refresh_browsers.label" = "Browser aktualisieren Schaltfläche";
"accessibility.settings.refresh_browsers.hint" = "Tippen, um die Liste der verfügbaren Browser zu aktualisieren";
"accessibility.settings.notify_fallback.label" = "Bei Fallback benachrichtigen Umschalter";
"accessibility.settings.notify_fallback.hint" = "Wenn aktiviert, erhalten Sie eine Benachrichtigung, wenn eine URL mit dem Fallback-Browser geöffnet wird";
"accessibility.settings.notify_fallback.value.enabled" = "Fallback-Benachrichtigungen sind aktiviert";
"accessibility.settings.notify_fallback.value.disabled" = "Fallback-Benachrichtigungen sind deaktiviert";

// Settings - Logging Section
"accessibility.settings.logging.section_label" = "Protokollierung Einstellungen Bereich";
"accessibility.settings.logging.enable.label" = "Protokollierung aktivieren Umschalter";
"accessibility.settings.logging.enable.hint" = "Wenn aktiviert, protokolliert Proxly geöffnete URLs und diagnostische Nachrichten zur Fehlerbehebung";
"accessibility.settings.logging.enable.value.enabled" = "Protokollierung ist aktiviert";
"accessibility.settings.logging.enable.value.disabled" = "Protokollierung ist deaktiviert";

// MARK: - Missing Strings
"Navigation Tab Bar" = "Navigations-Tab-Leiste";
"Unknown Browser" = "Unbekannter Browser";
"%@ %lld" = "%@ %lld";
"" = "";

// MARK: - Direct Settings Accessibility Keys (matching LocalizationHelper structure)
"accessibility.settings.enable_rules.label" = "Regeln aktivieren Umschalter";
"accessibility.settings.enable_rules.hint" = "Wenn aktiviert, sind alle Regeln aktiv. Wenn deaktiviert, werden alle Regeln ignoriert";
"accessibility.settings.enable_rules.value.enabled" = "Regeln sind aktiviert";
"accessibility.settings.enable_rules.value.disabled" = "Regeln sind deaktiviert";
"accessibility.settings.launch_at_login.label" = "Beim Anmelden starten Umschalter";
"accessibility.settings.launch_at_login.hint" = "Wenn aktiviert, startet Proxly automatisch beim Anmelden bei Ihrem Mac";
"accessibility.settings.launch_at_login.value.enabled" = "Beim Anmelden starten ist aktiviert";
"accessibility.settings.launch_at_login.value.disabled" = "Beim Anmelden starten ist deaktiviert";

// MARK: - About Accessibility
"accessibility.about.toolbar.title.label" = "Über Proxly";
"accessibility.about.toolbar.title.hint" = "Informationen über die Proxly-App, Funktionen und Entwickler";

"accessibility.about.navigation.scroll_view.label" = "Über-Informationen";
"accessibility.about.navigation.scroll_view.hint" = "Scrollen Sie, um App-Informationen, Funktionen und Links anzuzeigen";

"accessibility.about.app_info.section_label" = "App-Informationen";
"accessibility.about.app_info.app_icon.label" = "Proxly App-Symbol";
"accessibility.about.app_info.app_icon.hint" = "Offizielles Symbol der Proxly-Anwendung";
"accessibility.about.app_info.app_name.label" = "Proxly - Intelligenter Browser-Router";
"accessibility.about.app_info.app_subtitle.label" = "Intelligentes Browser-Routing für macOS";
"accessibility.about.app_info.version_badge.label" = "%@ %@";
"accessibility.about.app_info.version_badge.hint" = "App-Versions- und Build-Informationen";

"accessibility.about.description.section_label" = "App-Beschreibung";
"accessibility.about.description.section_hint" = "Erfahren Sie, was Proxly tut und wie es bei der Browser-Verwaltung hilft";
"accessibility.about.description.main_text.label" = "Haupt-App-Beschreibung";
"accessibility.about.description.detail_text.label" = "Detaillierte App-Beschreibung";

"accessibility.about.features.section_label" = "App-Funktionen";
"accessibility.about.features.section_hint" = "Entdecken Sie alle leistungsstarken Funktionen, die Proxly bietet";
"accessibility.about.features.feature_row.label" = "Funktion: %@";
"accessibility.about.features.feature_row.hint" = "Beschreibung: %@";
"accessibility.about.features.feature_list.label" = "Liste der Proxly-Funktionen";

"accessibility.about.developer.section_label" = "Entwickler-Informationen";
"accessibility.about.developer.section_hint" = "Erfahren Sie mehr über die Person, die Proxly erstellt hat";
"accessibility.about.developer.photo.label" = "Entwicklerfoto";
"accessibility.about.developer.photo.hint" = "Foto von Paweł Mazurkiewicz, dem Entwickler von Proxly";
"accessibility.about.developer.name.label" = "Entwicklername: Paweł Mazurkiewicz";
"accessibility.about.developer.role.label" = "Rolle: macOS-Entwickler";
"accessibility.about.developer.description.label" = "Bio: Schöne, funktionale Apps für Mac erstellen";

"accessibility.about.links.section_label" = "Links und Support";
"accessibility.about.links.section_hint" = "Zugang zu Support, Funktionsanfragen und App-Bewertung";
"accessibility.about.links.link_button.label" = "%@ Schaltfläche";
"accessibility.about.links.link_button.hint" = "%@ - tippen zum Öffnen";
"accessibility.about.links.support_button.label" = "Support kontaktieren";
"accessibility.about.links.support_button.hint" = "E-Mail senden, um Hilfe bei Proxly zu erhalten oder Fehler zu melden";
"accessibility.about.links.feature_request_button.label" = "Funktion anfordern";
"accessibility.about.links.feature_request_button.hint" = "E-Mail senden, um neue Funktionen für Proxly vorzuschlagen";
"accessibility.about.links.rate_button.label" = "Im App Store bewerten";
"accessibility.about.links.rate_button.hint" = "App Store öffnen, um Proxly zu bewerten und zu rezensieren";

// MARK: - Additional Settings Accessibility
"accessibility.settings.enable_rules.label" = "Regeln aktivieren Umschalter";
"accessibility.settings.enable_rules.hint" = "Wenn aktiviert, sind alle Regeln aktiv. Wenn deaktiviert, werden alle Regeln ignoriert";
"accessibility.settings.enable_rules.value.enabled" = "Regeln sind aktiviert";
"accessibility.settings.enable_rules.value.disabled" = "Regeln sind deaktiviert";
"accessibility.settings.launch_at_login.label" = "Beim Anmelden starten Umschalter";
"accessibility.settings.launch_at_login.hint" = "Wenn aktiviert, startet Proxly automatisch beim Anmelden an Ihrem Mac";
"accessibility.settings.launch_at_login.value.enabled" = "Beim Anmelden starten ist aktiviert";
"accessibility.settings.launch_at_login.value.disabled" = "Beim Anmelden starten ist deaktiviert";

// MARK: - ContentView Accessibility
"accessibility.content_view.container_label" = "Proxly Hauptfenster";
"accessibility.content_view.container_hint" = "Das Hauptanwendungsfenster mit Navigations-Tabs für Regeln, Einstellungen und Über";

"accessibility.content_view.tab_view.container_label" = "Hauptnavigation";
"accessibility.content_view.tab_view.container_hint" = "Tab-Navigation zum Wechseln zwischen verschiedenen Bereichen von Proxly";

"accessibility.content_view.tab.rules.label" = "Regeln-Tab";
"accessibility.content_view.tab.rules.hint" = "Tippen, um Browser-Routing-Regeln anzuzeigen und zu verwalten";
"accessibility.content_view.tab.rules.selected" = "Regeln-Tab ausgewählt";
"accessibility.content_view.tab.rules.unselected" = "Regeln-Tab nicht ausgewählt";

"accessibility.content_view.tab.settings.label" = "Einstellungen-Tab";
"accessibility.content_view.tab.settings.hint" = "Tippen, um Anwendungseinstellungen anzuzeigen und zu ändern";
"accessibility.content_view.tab.settings.selected" = "Einstellungen-Tab ausgewählt";
"accessibility.content_view.tab.settings.unselected" = "Einstellungen-Tab nicht ausgewählt";

"accessibility.content_view.tab.about.label" = "Über-Tab";
"accessibility.content_view.tab.about.hint" = "Tippen, um Informationen über Proxly und Entwicklerdetails anzuzeigen";
"accessibility.content_view.tab.about.selected" = "Über-Tab ausgewählt";
"accessibility.content_view.tab.about.unselected" = "Über-Tab nicht ausgewählt";

// MARK: - RuleList Accessibility
"accessibility.rule_list.navigation.container_label" = "Regeln Navigation";
"accessibility.rule_list.navigation.container_hint" = "Geteilte Ansicht Navigation mit Regelliste und Bearbeitungsoberfläche";
"accessibility.rule_list.navigation.sidebar_label" = "Regeln Seitenleiste";
"accessibility.rule_list.navigation.sidebar_hint" = "Liste aller Ihrer Browser-Routing-Regeln";

"accessibility.rule_list.toolbar.title_label" = "Regeln Bildschirm Titel";
"accessibility.rule_list.toolbar.title_hint" = "Haupttitel für den Regelverwaltungsbildschirm";

"accessibility.rule_list.button.add_rule_label" = "Regel hinzufügen";
"accessibility.rule_list.button.add_rule_hint" = "Tippen um eine neue Browser-Routing-Regel zu erstellen";

"accessibility.rule_list.toggle.rules_enabled_label" = "Regeln aktiviert Schalter";
"accessibility.rule_list.toggle.rules_enabled_hint" = "Schalten um alle Regeln zu aktivieren oder zu deaktivieren. Wenn deaktiviert, werden alle Regeln ignoriert";
"accessibility.rule_list.toggle.rules_enabled_value_on" = "Regeln sind aktiviert";
"accessibility.rule_list.toggle.rules_enabled_value_off" = "Regeln sind deaktiviert";

"accessibility.rule_list.empty_state.container_label" = "Keine Regeln Nachricht";
"accessibility.rule_list.empty_state.container_hint" = "Informationsanzeige wenn noch keine Regeln erstellt wurden";
"accessibility.rule_list.empty_state.description_label" = "Keine Regeln Beschreibung";
"accessibility.rule_list.empty_state.description_hint" = "Erklärung was Regeln tun und warum sie nützlich sind";
"accessibility.rule_list.empty_state.create_button_label" = "Erste Regel erstellen";
"accessibility.rule_list.empty_state.create_button_hint" = "Tippen um Ihre erste Browser-Routing-Regel zu erstellen";

"accessibility.rule_list.list.scroll_view_label" = "Regeln Liste";
"accessibility.rule_list.list.scroll_view_hint" = "Scrollbare Liste mit %d Regeln";

"accessibility.rule_list.rule_card.button_label" = "Regel %@";
"accessibility.rule_list.rule_card.button_hint" = "Tippen um diese Regel anzuzeigen und zu bearbeiten";
"accessibility.rule_list.rule_card.selected_value" = "Ausgewählt";
"accessibility.rule_list.rule_card.unselected_value" = "Nicht ausgewählt";

"accessibility.rule_list.rule_card.type_label" = "Regeltyp: %@";
"accessibility.rule_list.rule_card.type_hint" = "Der Typ der Bedingung mit der diese Regel übereinstimmt";

"accessibility.rule_list.rule_card.name_label" = "Regelname: %@";

"accessibility.rule_list.rule_card.condition_label" = "Bedingung: %@";

"accessibility.rule_list.rule_card.browser_label" = "Zielbrowser: %@";
"accessibility.rule_list.rule_card.browser_hint" = "Der Browser der Links öffnet die mit dieser Regel übereinstimmen";

"accessibility.rule_list.rule_card.priority_label" = "Priorität: %d";
"accessibility.rule_list.rule_card.priority_hint" = "Regel-Prioritätsstufe - höhere Zahlen haben Vorrang";

"accessibility.rule_list.detail.edit_view_label" = "Regel bearbeiten %@";
"accessibility.rule_list.detail.edit_view_hint" = "Regelbearbeitungsoberfläche zum Ändern der Regeleinstellungen";
"accessibility.rule_list.detail.placeholder_label" = "Regel auswählen";
"accessibility.rule_list.detail.placeholder_hint" = "Wählen Sie eine Regel aus der Liste um ihre Details anzuzeigen und zu bearbeiten";

// MARK: - MenuBarManager Accessibility
"accessibility.menu_bar_manager.status_item.button_label" = "Proxly Menüleiste";
"accessibility.menu_bar_manager.status_item.button_hint_enabled" = "Proxly ist aktiv und Regeln sind aktiviert. Linksklick zum Öffnen der Einstellungen, Rechtsklick für Schnellaktionen";
"accessibility.menu_bar_manager.status_item.button_hint_disabled" = "Proxly läuft, aber Regeln sind deaktiviert. Linksklick zum Öffnen der Einstellungen, Rechtsklick für Schnellaktionen";
"accessibility.menu_bar_manager.status_item.role_description" = "Menüleisten-Anwendung";
"accessibility.menu_bar_manager.status_item.value_enabled" = "Regeln aktiviert";
"accessibility.menu_bar_manager.status_item.value_disabled" = "Regeln deaktiviert";

"accessibility.menu_bar_manager.menu.container_label" = "Proxly Menü";
"accessibility.menu_bar_manager.menu.container_hint" = "Schnellzugriff-Menü für Proxly-Einstellungen und -Aktionen";

"accessibility.menu_bar_manager.menu.toggle_rules.label" = "Regeln umschalten";
"accessibility.menu_bar_manager.menu.toggle_rules.hint" = "Alle Browser-Routing-Regeln aktivieren oder deaktivieren";

"accessibility.menu_bar_manager.menu.open_settings.label" = "Einstellungen öffnen";
"accessibility.menu_bar_manager.menu.open_settings.hint" = "Das Hauptfenster der Proxly-Einstellungen öffnen";

"accessibility.menu_bar_manager.menu.quit.label" = "Proxly beenden";
"accessibility.menu_bar_manager.menu.quit.hint" = "Die Proxly-Anwendung beenden";

"accessibility.menu_bar_manager.actions.left_click" = "Einstellungen öffnen";
"accessibility.menu_bar_manager.actions.right_click" = "Menü anzeigen";
"accessibility.menu_bar_manager.actions.open_settings" = "Einstellungsfenster öffnen";
"accessibility.menu_bar_manager.actions.toggle_rules" = "Regelaktivierung umschalten";
"accessibility.menu_bar_manager.actions.quit" = "Anwendung beenden";

// MARK: - SelectionPanel Accessibility
"accessibility.selection_panel.container.label" = "Browser-Auswahl-Panel";
"accessibility.selection_panel.container.hint" = "Wählen Sie, mit welchem Browser der Link geöffnet werden soll. Verwenden Sie Pfeiltasten zum Navigieren, Enter zum Auswählen oder Escape zum Abbrechen";
"accessibility.selection_panel.container.role_description" = "Modaler Dialog für Browser-Auswahl";

"accessibility.selection_panel.header.section_label" = "Browser-Auswahl-Header";
"accessibility.selection_panel.header.title.label" = "Browser wählen";
"accessibility.selection_panel.header.title.hint" = "Haupttitel für den Browser-Auswahl-Dialog";
"accessibility.selection_panel.header.subtitle.label" = "Wählen Sie, welcher Browser diesen Link öffnen soll";
"accessibility.selection_panel.header.subtitle.hint" = "Anweisungen für die Verwendung des Browser-Auswahl-Dialogs";
"accessibility.selection_panel.header.icon.label" = "Browser-Auswahl-Symbol";

"accessibility.selection_panel.browser_grid.container_label" = "Verfügbare Browser";
"accessibility.selection_panel.browser_grid.container_hint" = "%d Browser verfügbar. Verwenden Sie Pfeiltasten zum Navigieren zwischen den Optionen";
"accessibility.selection_panel.browser_grid.section_label" = "Browser-Optionen-Raster";

"accessibility.selection_panel.browser_card.button_label" = "%@ Browser auswählen";
"accessibility.selection_panel.browser_card.button_label_with_shortcut" = "%@ Browser auswählen, Tastenkürzel %d";
"accessibility.selection_panel.browser_card.button_hint" = "Tippen oder Enter drücken, um den Link mit diesem Browser zu öffnen";
"accessibility.selection_panel.browser_card.button_hint_with_shortcut" = "Tippen, Enter drücken oder %d drücken, um den Link mit diesem Browser zu öffnen";
"accessibility.selection_panel.browser_card.icon_label" = "%@ Browser-Symbol";
"accessibility.selection_panel.browser_card.name_label" = "%@ Browser-Name";
"accessibility.selection_panel.browser_card.shortcut_badge_label" = "Tastenkürzel %d";
"accessibility.selection_panel.browser_card.shortcut_badge_hint" = "Drücken Sie diese Zahlentaste, um diesen Browser schnell auszuwählen";
"accessibility.selection_panel.browser_card.role_description" = "Browser-Auswahl-Schaltfläche";

"accessibility.selection_panel.url_section.container_label" = "URL-Informationen";
"accessibility.selection_panel.url_section.container_hint" = "Zeigt die Webadresse an, die geöffnet wird";
"accessibility.selection_panel.url_section.section_label" = "URL-Bereich";
"accessibility.selection_panel.url_section.icon_label" = "Link-Symbol";
"accessibility.selection_panel.url_section.title_label" = "Öffnen:";
"accessibility.selection_panel.url_section.url_label" = "Webadresse: %@";
"accessibility.selection_panel.url_section.url_hint" = "Dies ist die Webadresse, die im ausgewählten Browser geöffnet wird";

"accessibility.selection_panel.action_section.container_label" = "Aktionen und Anweisungen";
"accessibility.selection_panel.action_section.container_hint" = "Enthält Verwendungsanweisungen und Abbrechen-Option";
"accessibility.selection_panel.action_section.section_label" = "Aktions-Bereich";
"accessibility.selection_panel.action_section.instructions_label" = "Drücken Sie 1-9 oder klicken Sie zum Auswählen";
"accessibility.selection_panel.action_section.instructions_hint" = "Anweisungen zur Browser-Auswahl mit Tastenkürzeln oder Maus";
"accessibility.selection_panel.action_section.cancel_button.label" = "Browser-Auswahl abbrechen";
"accessibility.selection_panel.action_section.cancel_button.hint" = "Browser-Auswahl-Panel schließen, ohne einen Browser zu öffnen";
"accessibility.selection_panel.action_section.cancel_button.role_description" = "Abbrechen-Schaltfläche";

"accessibility.selection_panel.navigation.focus_moved_to_browser" = "Fokus auf Browser-Option verschoben";
"accessibility.selection_panel.navigation.focus_moved_to_cancel" = "Fokus auf Abbrechen-Schaltfläche verschoben";
"accessibility.selection_panel.navigation.browser_selected" = "Browser ausgewählt";
"accessibility.selection_panel.navigation.panel_dismissed" = "Browser-Auswahl-Panel geschlossen";

"accessibility.selection_panel.actions.select_browser" = "Browser auswählen";
"accessibility.selection_panel.actions.cancel" = "Auswahl abbrechen";
"accessibility.selection_panel.actions.dismiss" = "Panel schließen";

"accessibility.selection_panel.announcements.panel_opened" = "Browser-Auswahl-Panel geöffnet mit %d verfügbaren Browsern für %@";
"accessibility.selection_panel.announcements.browser_focused" = "%@ Browser fokussiert";
"accessibility.selection_panel.announcements.browser_focused_with_shortcut" = "%@ Browser fokussiert, Tastenkürzel %d";
"accessibility.selection_panel.announcements.browser_selected" = "%@ Browser ausgewählt, Link wird geöffnet";
"accessibility.selection_panel.announcements.panel_cancelled" = "Browser-Auswahl abgebrochen";
"accessibility.selection_panel.announcements.auto_dismiss_warning" = "Browser-Auswahl-Panel wird automatisch in 10 Sekunden geschlossen";

// MARK: - Onboarding
"onboarding.container.label" = "Einführung";
"onboarding.container.hint" = "Willkommen zur Proxly-Einführung. Erfahren Sie mehr über die App-Funktionen und legen Sie los.";

// Onboarding Pages
"onboarding.page.welcome.label" = "Willkommensseite";
"onboarding.page.welcome.hint" = "Einführung in die Proxly-Anwendung";
"onboarding.page.what_is.label" = "Was ist Proxly-Seite";
"onboarding.page.what_is.hint" = "Erfahren Sie, was Proxly macht und wie es funktioniert";
"onboarding.page.rules.label" = "Regeln-Seite";
"onboarding.page.rules.hint" = "Verstehen Sie, wie Regeln in Proxly funktionieren";
"onboarding.page.menu_bar.label" = "Menüleisten-Seite";
"onboarding.page.menu_bar.hint" = "Erfahren Sie mehr über die Menüleisten-Integration";
"onboarding.page.focus_modes.label" = "Fokus-Modi-Seite";
"onboarding.page.focus_modes.hint" = "Entdecken Sie die Integration des Fokus-Modus";
"onboarding.page.get_started.label" = "Erste Schritte-Seite";
"onboarding.page.get_started.hint" = "Schließen Sie die Einrichtung ab und beginnen Sie mit Proxly";

// Onboarding Controls
"onboarding.button.previous" = "Zurück";
"onboarding.button.previous.label" = "Vorherige Seite";
"onboarding.button.previous.hint" = "Zur vorherigen Einführungsseite gehen";
"onboarding.button.next" = "Weiter";
"onboarding.button.next.label" = "Nächste Seite";
"onboarding.button.next.hint" = "Zur nächsten Einführungsseite gehen";
"onboarding.button.get_started" = "Loslegen";
"onboarding.button.get_started.label" = "Loslegen";
"onboarding.button.get_started.hint" = "Einführung abschließen und mit Proxly beginnen";

"onboarding.page_indicator.label" = "Seitenanzeige";
"onboarding.page_indicator.value" = "Seite %d von %d";
"onboarding.page_indicator.hint" = "Aktuelle Seitenposition in der Einführung";
"onboarding.page_indicators.label" = "Seitenanzeigen";
"onboarding.page_indicators.value" = "Seite %d von %d";

// Symbol Accessibility
"onboarding.symbol.light.label" = "Proxly-App-Symbol im hellen Modus";
"onboarding.symbol.light.hint" = "Dekoratives App-Symbol im hellen Erscheinungsbild angezeigt";
"onboarding.symbol.dark.label" = "Proxly-App-Symbol im dunklen Modus";
"onboarding.symbol.dark.hint" = "Dekoratives App-Symbol im dunklen Erscheinungsbild angezeigt";

// Welcome Page
"onboarding.welcome.title" = "Willkommen bei Proxly!";
"onboarding.welcome.subtitle" = "Übernehmen Sie die Kontrolle über Ihr Web-Browsing-Erlebnis";
"onboarding.welcome.description" = "Proxly hilft Ihnen dabei zu verwalten, wie Links geöffnet werden, und leitet sie mühelos an den richtigen Browser basierend auf Ihren benutzerdefinierten Regeln weiter.";
"onboarding.welcome.app_icon.label" = "Proxly-Anwendungssymbol";
"onboarding.welcome.app_icon.hint" = "Das offizielle Proxly-App-Symbol";

// What is Proxly Page
"onboarding.what_is.title" = "Was Kann Proxly für Sie Tun?";
"onboarding.what_is.subtitle" = "Intelligente Browser-Weiterleitung leicht gemacht";
"onboarding.what_is.urls.title" = "URLs";
"onboarding.what_is.browsers.title" = "Browser";
"onboarding.what_is.explanation" = "Proxly öffnet automatisch Links im richtigen Browser oder in der richtigen App oder kann sie sogar blockieren, alles basierend auf Ihren benutzerdefinierten Regeln. Kein manuelles Kopieren und Einfügen von Links mehr!";

// What is Proxly Demo Accessibility
"onboarding.what_is.urls.demo.label" = "Beispiel-URLs-Demonstration";
"onboarding.what_is.urls.demo.hint" = "Zeigt Beispiel-Website-URLs, die von Proxly weitergeleitet werden können";
"onboarding.what_is.arrow.label" = "Pfeil, der die Richtung anzeigt";
"onboarding.what_is.arrow.hint" = "Zeigt den Fluss von URLs zu Browsern";
"onboarding.what_is.browsers.demo.label" = "Beispiel-Browser-Demonstration";
"onboarding.what_is.browsers.demo.hint" = "Zeigt Beispiel-Browser, die als Weiterleitungsziele verwendet werden können";

// Demo Components Accessibility
"onboarding.url_demo.label" = "Beispiel-Website-URL";
"onboarding.url_demo.hint" = "Demonstriert, wie verschiedene Websites für die Weiterleitung kategorisiert werden können";
"onboarding.browser_demo.label" = "Beispiel-Browser-Option";
"onboarding.browser_demo.hint" = "Demonstriert verfügbare Browser-Optionen für die Weiterleitung";

// Rules Page
"onboarding.rules.title" = "Sie Haben die Kontrolle mit Regeln";
"onboarding.rules.subtitle" = "Regeln sind das Herzstück von Proxly";
"onboarding.rules.example.work.title" = "Arbeits-Domains";
"onboarding.rules.example.work.description" = "Arbeits-domain.com-Links immer in Chrome öffnen";
"onboarding.rules.example.social.title" = "Soziale Medien";
"onboarding.rules.example.social.description" = "Soziale-Medien-Links in Ihrem Lieblingsbrowser öffnen";
"onboarding.rules.example.focus.title" = "Fokus-Modus";
"onboarding.rules.example.focus.description" = "Ablenkende-Seite.com blockieren, wenn der Arbeits-Fokus-Modus aktiv ist";

// Rules Examples Accessibility
"onboarding.rules.example.work.accessibility.label" = "Arbeits-Domain-Regel-Beispiel";
"onboarding.rules.example.work.accessibility.hint" = "Demonstriert, wie arbeitsbezogene Websites an bestimmte Browser weitergeleitet werden";
"onboarding.rules.example.social.accessibility.label" = "Soziale-Medien-Regel-Beispiel";
"onboarding.rules.example.social.accessibility.hint" = "Demonstriert, wie soziale Medien-Websites an bevorzugte Browser weitergeleitet werden";
"onboarding.rules.example.focus.accessibility.label" = "Fokus-Modus-Regel-Beispiel";
"onboarding.rules.example.focus.accessibility.hint" = "Demonstriert, wie ablenkende Websites während der Fokuszeit blockiert werden";

// Menu Bar Page
"onboarding.menu_bar.title" = "Schnellzugriff von Ihrer Menüleiste";
"onboarding.menu_bar.subtitle" = "Behalten Sie Proxly im Auge und verwalten Sie es einfach";
"onboarding.menu_bar.proxly_icon.label" = "Proxly-Menüleisten-Symbol";
"onboarding.menu_bar.proxly_icon.hint" = "Das Proxly-Symbol in der Menüleiste Ihres Mac";
"onboarding.menu_bar.feature.status.title" = "Sehen Sie, ob Proxly aktiv ist";
"onboarding.menu_bar.feature.status.description" = "Visuelle Anzeige zeigt, wenn Regeln aktiviert sind";
"onboarding.menu_bar.feature.toggle.title" = "Proxly schnell aktivieren oder deaktivieren";
"onboarding.menu_bar.feature.toggle.description" = "Alle Regeln mit einem Klick ein- oder ausschalten";
"onboarding.menu_bar.feature.settings.title" = "Proxly-Einstellungen öffnen";
"onboarding.menu_bar.feature.settings.description" = "Zugriff auf Regel-Editor und Konfiguration";

// Menu Bar Accessibility
"onboarding.menu_bar.wifi.label" = "WLAN-Status-Symbol";
"onboarding.menu_bar.battery.label" = "Batterie-Status-Symbol";
"onboarding.menu_bar.mockup.label" = "Menüleisten-Mockup";
"onboarding.menu_bar.mockup.hint" = "Demonstration, wie Proxly in der Menüleiste Ihres Mac erscheint";
"onboarding.menu_bar.features.label" = "Menüleisten-Funktionen-Liste";
"onboarding.menu_bar.features.hint" = "Listet die Hauptfunktionen auf, die über die Menüleiste verfügbar sind";
"onboarding.menu_bar.feature.label" = "Menüleisten-Funktion";
"onboarding.menu_bar.feature.hint" = "Einzelne Funktion, die über die Proxly-Menüleiste verfügbar ist";

// Focus Modes Page
"onboarding.focus_modes.title" = "Smarteres Browsing mit Fokus-Modi";
"onboarding.focus_modes.subtitle" = "Synchronisieren Sie mit Ihren macOS-Fokus-Modi";
"onboarding.focus_modes.work.description" = "Verschiedene Browser für die Arbeitszeit";
"onboarding.focus_modes.personal.description" = "Persönliche Seiten während der persönlichen Zeit";
"onboarding.focus_modes.dnd.description" = "Ablenkende Seiten während Nicht Stören blockieren";
"onboarding.focus_modes.permission_note" = "Proxly wird um Erlaubnis bitten, auf Fokus-Modi zuzugreifen, um diese Funktion zu aktivieren.";

// Focus Modes Examples Accessibility
"onboarding.focus_modes.work.accessibility.label" = "Arbeits-Fokus-Modus-Beispiel";
"onboarding.focus_modes.work.accessibility.hint" = "Demonstriert, wie Proxly Browser während der Arbeits-Fokuszeit unterschiedlich weiterleiten kann";
"onboarding.focus_modes.personal.accessibility.label" = "Persönlicher-Fokus-Modus-Beispiel";
"onboarding.focus_modes.personal.accessibility.hint" = "Demonstriert, wie Proxly Browser während der persönlichen Zeit unterschiedlich weiterleiten kann";
"onboarding.focus_modes.dnd.accessibility.label" = "Nicht-Stören-Fokus-Modus-Beispiel";
"onboarding.focus_modes.dnd.accessibility.hint" = "Demonstriert, wie Proxly ablenkende Websites während Nicht Stören blockieren kann";
"onboarding.focus_modes.permission_note.label" = "Fokus-Modi-Berechtigungshinweis";
"onboarding.focus_modes.permission_note.hint" = "Informationen über Berechtigungsanforderungen für die Fokus-Modus-Integration";

// Get Started Page
"onboarding.get_started.title" = "Bereit, Ihre Erste Regel zu Erstellen?";
"onboarding.get_started.subtitle" = "Der beste Weg, Proxly zu erleben, ist die Einrichtung Ihrer ersten Regel";
"onboarding.get_started.step1.title" = "Als Standard-Browser festlegen";
"onboarding.get_started.step1.description" = "Legen Sie Proxly als Ihren Standard-Browser in den Systemeinstellungen fest";
"onboarding.get_started.step2.title" = "Ihre Erste Regel Erstellen";
"onboarding.get_started.step2.description" = "Fügen Sie eine Regel hinzu, um bestimmte Domains an Ihren bevorzugten Browser weiterzuleiten";
"onboarding.get_started.step3.title" = "Testen und Genießen";
"onboarding.get_started.step3.description" = "Klicken Sie auf einen beliebigen Link und beobachten Sie, wie Proxly ihn intelligent weiterleitet";
"onboarding.get_started.ready_message" = "Sie Sind Bereit!";
"onboarding.get_started.help_message" = "Erkunden Sie Proxlys Einstellungen, um es weiter anzupassen. Sie können jederzeit Regeln hinzufügen, ändern oder entfernen, wenn sich Ihre Bedürfnisse entwickeln.";

// Get Started Accessibility
"onboarding.get_started.completion.label" = "Einrichtungsabschluss-Nachricht";
"onboarding.get_started.completion.hint" = "Glückwunsch-Nachricht, die anzeigt, dass die Proxly-Einrichtung abgeschlossen ist";
"onboarding.setup_step.button.label" = "Einrichtungsschritt mit Aktion";
"onboarding.setup_step.button.hint" = "Interaktiver Einrichtungsschritt, der angeklickt werden kann, um eine Aktion auszuführen";
"onboarding.setup_step.info.label" = "Einrichtungsschritt-Information";
"onboarding.setup_step.info.hint" = "Informativer Einrichtungsschritt, der Anweisungen zum Abschluss der Einrichtung bereitstellt";
// MARK: - License Sheet
"about.license_sheet.title" = "Open Source Lizenzen";
"about.license_sheet.description" = "Diese Anwendung verwendet die folgenden Open Source Software-Bibliotheken:";
"about.license_sheet.button.done" = "Fertig";
"about.license_sheet.swiftglass.name" = "SwiftGlass";
"about.license_sheet.swiftglass.version" = "Version: 1.9.9";
"about.license_sheet.swiftglass.source" = "Quelle: https://github.com/1998code/SwiftGlass/";

// MARK: - About Links
"about.link.licenses" = "Open Source Lizenzen";
"about.link.licenses_description" = "Open Source Software-Lizenzen anzeigen";

// MARK: - License Sheet Accessibility
"accessibility.about.license_sheet.title.label" = "Open Source Lizenzen";
"accessibility.about.license_sheet.title.hint" = "Informationen über Drittanbieter-Bibliotheken, die in Proxly verwendet werden";
"accessibility.about.license_sheet.description.label" = "Lizenzinformations-Header";
"accessibility.about.license_sheet.description.hint" = "Erklärt, welche Informationen in dieser Ansicht angezeigt werden";
"accessibility.about.license_sheet.done_button.label" = "Fertig";
"accessibility.about.license_sheet.done_button.hint" = "Schließt das Lizenzinformations-Blatt";
"accessibility.about.license_sheet.swiftglass.section.label" = "SwiftGlass-Bibliothek-Lizenz";
"accessibility.about.license_sheet.swiftglass.section.hint" = "Lizenzinformationen für die SwiftGlass-Bibliothek";
"accessibility.about.license_sheet.scroll_view.label" = "Open Source Lizenzen";
"accessibility.about.license_sheet.scroll_view.hint" = "Scrollen Sie, um Lizenzinformationen für Drittanbieter-Bibliotheken anzuzeigen";

// MARK: - About Links Accessibility
"accessibility.about.links.licenses_button.label" = "Open Source Lizenzen";
"accessibility.about.links.licenses_button.hint" = "Öffnet ein Blatt mit Lizenzinformationen für Open Source Software";

// MARK: - Rule Management
"rule.remove" = "Regel Entfernen";
"rule.drop_browser" = "URL Verwerfen (Blockieren)";
"rule.drop_browser.description" = "Diese URL blockieren und das Öffnen verhindern";
"rule.enable.title" = "Regel Aktivieren";
"rule.enable.subtitle" = "Wenn aktiviert, ist diese Regel aktiv und wird für URL-Weiterleitung verwendet";

// MARK: - Browser Profile Selector
"browser_profile_selector.profile" = "Profil";
"browser_profile_selector.custom_arguments" = "Benutzerdefinierte Argumente";
"browser_profile_selector.no_profile_support" = "Keine Profilunterstützung";
"browser_profile_selector.permission_needed" = "Berechtigung erforderlich";
"browser_profile_selector.permission_denied" = "Berechtigung verweigert";
"browser_profile_selector.permission_expired" = "Berechtigung abgelaufen";
"browser_profile_selector.profiles_count" = "%d Profile";
"browser_profile_selector.no_profiles_found" = "Keine Profile gefunden";
"browser_profile_selector.standard_browser" = "Standard-Browser";
"browser_profile_selector.tap_to_enable_profiles" = "Tippen Sie, um Profile zu aktivieren";
"browser_profile_selector.does_not_support_profiles" = "%@ unterstützt keine Profile";

// MARK: - Profile Permission View
"profile_permission.title" = "Browser-Profilunterstützung";
"profile_permission.subtitle" = "Links direkt in spezifischen Browserprofilen öffnen";
"profile_permission.what_enables" = "Was dies ermöglicht:";
"profile_permission.benefit.separate_browsing.title" = "Arbeits- und privates Surfen trennen";
"profile_permission.benefit.separate_browsing.description" = "Halten Sie Ihr Arbeits- und privates Surfen vollständig getrennt";
"profile_permission.benefit.different_extensions.title" = "Verschiedene Erweiterungen pro Profil verwenden";
"profile_permission.benefit.different_extensions.description" = "Jedes Profil kann seine eigenen Erweiterungen und Einstellungen haben";
"profile_permission.benefit.profile_configs.title" = "Profilspezifische Konfigurationen";
"profile_permission.benefit.profile_configs.description" = "Verschiedene Themes, Lesezeichen und Einstellungen für jedes Profil";
"profile_permission.permission_required" = "Berechtigung erforderlich:";
"profile_permission.requirement.read_access.title" = "Nur-Lese-Zugriff auf Browser-Verzeichnisse";
"profile_permission.requirement.read_access.description" = "Proxly muss Konfigurationsdateien lesen, um Ihre Profile zu erkennen";
"profile_permission.requirement.no_data_access.title" = "Kein Zugriff auf persönliche Daten";
"profile_permission.requirement.no_data_access.description" = "Nur Profilnamen und grundlegende Einstellungen werden gelesen - keine Verlaufsdaten, Passwörter oder Browserdaten";
"profile_permission.requirement.optional.title" = "Völlig optional";
"profile_permission.requirement.optional.description" = "Sie können Proxly ohne Profilfunktionen verwenden - sie sind vollständig optional";
"profile_permission.browser_permissions" = "Browser-Berechtigungen:";
"profile_permission.learn_more" = "Mehr über Datenzugriff erfahren";
"profile_permission.done" = "Fertig";
"profile_permission.state.not_requested" = "Berechtigung nicht angefordert";
"profile_permission.state.denied" = "Berechtigung verweigert";
"profile_permission.state.granted" = "Berechtigung erteilt";
"profile_permission.state.needs_refresh" = "Berechtigung muss aktualisiert werden";
"profile_permission.button.requesting" = "Wird angefordert...";
"profile_permission.button.grant_access" = "Zugriff gewähren";
"profile_permission.button.retry" = "Wiederholen";
"profile_permission.button.revoke" = "Widerrufen";

// MARK: - Data Access Explanation
"data_access.title" = "Datenzugriffserklärung";
"data_access.what_accesses" = "Was Proxly zugreift:";
"data_access.access.config_files.title" = "Profilkonfigurationsdateien";
"data_access.access.config_files.description" = "Dateien wie 'Local State' (Chrome/Edge) und 'profiles.ini' (Firefox), die Profilnamen und grundlegende Einstellungen enthalten";
"data_access.access.directory_names.title" = "Profilverzeichnisnamen";
"data_access.access.directory_names.description" = "Die Namen der Profilordner zur Identifizierung verfügbarer Profile";
"data_access.never_accesses" = "Was Proxly NIEMALS zugreift:";
"data_access.never.browsing_history.title" = "Browserverlauf";
"data_access.never.browsing_history.description" = "Ihr Browserverlauf wird niemals gelesen oder abgerufen";
"data_access.never.passwords.title" = "Passwörter und Anmeldedaten";
"data_access.never.passwords.description" = "Keine Passwortdateien oder Anmeldeinformationen werden abgerufen";
"data_access.never.bookmarks.title" = "Lesezeichen und persönliche Daten";
"data_access.never.bookmarks.description" = "Persönliche Lesezeichen und Browserdaten bleiben privat";
"data_access.never.cookies.title" = "Cookies und Sitzungsdaten";
"data_access.never.cookies.description" = "Keine Cookies oder Sitzungsinformationen werden gelesen";
"data_access.technical_details" = "Technische Details:";
"data_access.technical.security_bookmarks.title" = "Sicherheitsbezogene Lesezeichen";
"data_access.technical.security_bookmarks.description" = "macOS-Sicherheitslesezeichen werden verwendet, um den Zugriff nur auf Verzeichnisse zu beschränken, die Sie ausdrücklich genehmigen";
"data_access.technical.read_only.title" = "Nur-Lese-Zugriff";
"data_access.technical.read_only.description" = "Proxly fordert nur Lesezugriff an - es kann Ihre Browserdaten nicht ändern";
"data_access.technical.revocable.title" = "Widerrufbare Berechtigungen";
"data_access.technical.revocable.description" = "Sie können den Zugriff jederzeit in Proxlys Einstellungen widerrufen";

// MARK: - Profile Selection View
"profile_selection.enable_support" = "Profilunterstützung aktivieren";
"profile_selection.grant_permission" = "Berechtigung für Zugriff auf %@-Profile gewähren";
"profile_selection.grant_permission_button" = "Berechtigung gewähren";
"profile_selection.permission_denied_title" = "Berechtigung verweigert";
"profile_selection.permission_denied_description" = "Profilunterstützung erfordert die Berechtigung zum Zugriff auf Browser-Verzeichnisse";
"profile_selection.retry_permission" = "Berechtigung wiederholen";
"profile_selection.permission_expired_title" = "Berechtigung abgelaufen";
"profile_selection.permission_expired_description" = "Profilberechtigung muss aktualisiert werden";
"profile_selection.refresh_permission" = "Berechtigung aktualisieren";
"profile_selection.detecting_profiles" = "Profile werden erkannt...";
"profile_selection.no_profiles_found" = "Keine Profile gefunden";
"profile_selection.no_profiles_description" = "Keine %@-Profile wurden erkannt. Sie können Profile in %@ erstellen und sie werden hier angezeigt.";
"profile_selection.select_profile" = "Ein Profil auswählen:";
"profile_selection.any_profile" = "Beliebiges Profil";
"profile_selection.use_default_profile" = "Standardprofil verwenden";
"profile_selection.default" = "Standard";
"profile_selection.used_time_ago" = "Verwendet %@";
"profile_selection.active" = "Aktiv";
"profile_selection.inactive" = "Inaktiv";

// MARK: - Custom Arguments View
"custom_arguments.title" = "Benutzerdefinierte Argumente";
"custom_arguments.placeholder" = "Argument hinzufügen (z.B. --incognito)";
"custom_arguments.add" = "Hinzufügen";
"custom_arguments.warning" = "Benutzerdefinierte Argumente können das Browserverhalten beeinflussen. Vorsichtig verwenden.";
"custom_arguments.help.title" = "Benutzerdefinierte Browser-Argumente";
"custom_arguments.help.common_arguments" = "Häufige Argumente";
"custom_arguments.help.incognito.argument" = "--incognito";
"custom_arguments.help.incognito.description" = "Im Inkognito-/privaten Browsing-Modus starten";
"custom_arguments.help.new_window.argument" = "--new-window";
"custom_arguments.help.new_window.description" = "In einem neuen Fenster öffnen";
"custom_arguments.help.disable_security.argument" = "--disable-web-security";
"custom_arguments.help.disable_security.description" = "Web-Sicherheit deaktivieren (nur für Entwicklung)";
"custom_arguments.help.private_window.argument" = "--private-window";
"custom_arguments.help.private_window.description" = "Im privaten Browsing-Modus starten";
"custom_arguments.help.new_tab.argument" = "--new-tab";
"custom_arguments.help.new_tab.description" = "URL in einem neuen Tab öffnen";
"custom_arguments.help.important_notes" = "Wichtige Hinweise";
"custom_arguments.help.note.behavior" = "Benutzerdefinierte Argumente können Browserverhalten und Sicherheit beeinflussen";
"custom_arguments.help.note.browser_specific" = "Argumente sind browserspezifisch und funktionieren möglicherweise nicht in allen Browsern";
"custom_arguments.help.note.trust" = "Verwenden Sie nur Argumente, die Sie verstehen und denen Sie vertrauen";
"custom_arguments.help.app_store_limitations" = "App Store-Einschränkungen";
"custom_arguments.help.app_store_description" = "Aufgrund von App Store-Sandbox-Beschränkungen funktionieren einige Argumente möglicherweise nicht wie erwartet. Der Browser wird auf das Standardverhalten zurückgreifen, wenn Argumente nicht unterstützt werden.";
"custom_arguments.help.done" = "Fertig";
"custom_arguments.help.compatible" = "Kompatibel: %@";

// MARK: - Settings Profile Features
"settings.profile_features.title" = "Profilfunktionen";
"settings.profile_features.enable.title" = "Profilfunktionen aktivieren";
"settings.profile_features.enable.subtitle.enabled" = "Profilfunktionen sind aktiviert";
"settings.profile_features.enable.subtitle.disabled" = "Profilfunktionen sind deaktiviert";
"settings.profile_features.manage_permissions.title" = "Profilberechtigungen verwalten";
"settings.profile_features.manage_permissions.subtitle" = "Konfigurieren Sie, welche Browser auf Profildaten zugreifen können";
"settings.profile_features.manage_permissions.button" = "Berechtigungen verwalten";

// MARK: - Browser Profile Accessibility
"accessibility.browser_profile_selector.profile.label" = "Profilauswahl";
"accessibility.browser_profile_selector.profile.hint" = "Wählen Sie ein Browserprofil für diese Regel";
"accessibility.browser_profile_selector.custom_arguments.label" = "Benutzerdefinierte Argumente";
"accessibility.browser_profile_selector.custom_arguments.hint" = "Fügen Sie benutzerdefinierte Befehlszeilenargumente für den Browser hinzu";
"accessibility.browser_profile_selector.refresh_profiles.label" = "Profile aktualisieren";
"accessibility.browser_profile_selector.refresh_profiles.hint" = "Liste der verfügbaren Profile aktualisieren";

// MARK: - Profile Permission Accessibility
"accessibility.profile_permission.title.label" = "Browser-Profilunterstützung";
"accessibility.profile_permission.title.hint" = "Informationen über Browser-Profilfunktionen und -berechtigungen";
"accessibility.profile_permission.benefit.label" = "Profilfunktionsvorteil";
"accessibility.profile_permission.benefit.hint" = "Erklärt, wie Profilfunktionen dabei helfen können, Ihr Surfen zu organisieren";
"accessibility.profile_permission.requirement.label" = "Berechtigungsanforderung";
"accessibility.profile_permission.requirement.hint" = "Informationen darüber, welche Berechtigungen benötigt werden und warum";
"accessibility.profile_permission.browser_row.label" = "Browser-Berechtigung für %@";
"accessibility.profile_permission.browser_row.hint" = "Profilzugriffsberechtigungen für diesen Browser verwalten";
"accessibility.profile_permission.learn_more.label" = "Mehr über Datenzugriff erfahren";
"accessibility.profile_permission.learn_more.hint" = "Öffnet detaillierte Erklärung, auf welche Daten Proxly zugreift";

// MARK: - Profile Selection Accessibility
"accessibility.profile_selection.enable_support.label" = "Profilunterstützung aktivieren";
"accessibility.profile_selection.enable_support.hint" = "Berechtigung für Zugriff auf Browserprofile gewähren";
"accessibility.profile_selection.permission_request.label" = "Profilberechtigungsanfrage";
"accessibility.profile_selection.permission_request.hint" = "Informationen über Profilberechtigungen mit Aktion zum Gewähren des Zugriffs";
"accessibility.profile_selection.profile_card.label" = "Profil %@";
"accessibility.profile_selection.profile_card.hint" = "Dieses Profil für die Regel auswählen";
"accessibility.profile_selection.any_profile.label" = "Beliebige Profiloption";
"accessibility.profile_selection.any_profile.hint" = "Das Standardprofil verwenden, ohne ein bestimmtes anzugeben";

// MARK: - Custom Arguments Accessibility
"accessibility.custom_arguments.title.label" = "Benutzerdefinierte Argumente";
"accessibility.custom_arguments.title.hint" = "Benutzerdefinierte Befehlszeilenargumente für den Browser hinzufügen";
"accessibility.custom_arguments.help.label" = "Hilfe zu benutzerdefinierten Argumenten";
"accessibility.custom_arguments.help.hint" = "Öffnet Hilfeinformationen zu Browser-Befehlszeilenargumenten";
"accessibility.custom_arguments.argument.label" = "Argument %@";
"accessibility.custom_arguments.argument.hint" = "Tippen Sie, um dieses Argument zu entfernen";
"accessibility.custom_arguments.add_field.label" = "Neues Argument hinzufügen";
"accessibility.custom_arguments.add_field.hint" = "Geben Sie ein benutzerdefiniertes Browser-Argument ein";
"accessibility.custom_arguments.add_button.label" = "Argument hinzufügen";
"accessibility.custom_arguments.add_button.hint" = "Das eingegebene Argument zur Liste hinzufügen";

// MARK: - Settings Profile Features Accessibility
"accessibility.settings.profile_features.section.label" = "Profilfunktionen-Bereich";
"accessibility.settings.profile_features.section.hint" = "Konfigurationsoptionen für Browser-Profilfunktionen";
"accessibility.settings.profile_features.enable.label" = "Profilfunktionen aktivieren";
"accessibility.settings.profile_features.enable.hint" = "Wenn aktiviert, ermöglicht das Öffnen von Links in spezifischen Browserprofilen";
"accessibility.settings.profile_features.enable.value.enabled" = "Profilfunktionen sind aktiviert";
"accessibility.settings.profile_features.enable.value.disabled" = "Profilfunktionen sind deaktiviert";
"accessibility.settings.profile_features.manage_permissions.label" = "Profilberechtigungen verwalten";
"accessibility.settings.profile_features.manage_permissions.hint" = "Öffnet die Profilberechtigungsmanagement-Schnittstelle";

/* Missing Menu Bar Manager Accessibility */
"accessibility.menu_bar_manager.status_item.button_label" = "Proxly Menü";
"accessibility.menu_bar_manager.status_item.button_hint_enabled" = "Proxly-Regeln sind aktiviert. Klicken Sie, um das Menü zu öffnen.";
"accessibility.menu_bar_manager.actions.open_settings" = "Einstellungen öffnen";

/* Missing Settings Accessibility */
"accessibility.settings.show_tooltips.label" = "Tooltips anzeigen umschalten";
"accessibility.settings.show_tooltips.hint" = "Umschalten, um hilfreiche Tooltips in der App ein- oder auszublenden";
"accessibility.settings.show_tooltips.value.enabled" = "Tooltips sind aktiviert";
"accessibility.settings.show_tooltips.value.disabled" = "Tooltips sind deaktiviert";

/* Missing Profile Features Settings */
"settings.section.profile_features" = "Profilfunktionen";
"accessibility.settings.profile_features.section_label" = "Profilfunktionen-Bereich";
"settings.profile_features.enable" = "Profilfunktionen aktivieren";
"settings.profile_features.subtitle.enabled" = "Profilfunktionen sind aktiviert";
"settings.profile_features.subtitle.disabled" = "Profilfunktionen sind deaktiviert";
"settings.profile_features.manage_permissions" = "Profilberechtigungen verwalten";
"settings.profile_features.manage_permissions.subtitle" = "Konfigurieren, welche Browser auf Profildaten zugreifen können";
"settings.profile_features.manage_permissions.button" = "Berechtigungen verwalten";

// MARK: - License Prompt View

// MARK: - License Management
"license.status.valid" = "Lizenz gültig";
"license.status.invalid" = "Ungültig: %@";
"license.status.not_verified" = "Lizenz nicht verifiziert";
"license.status.verifying" = "Lizenz wird verifiziert...";

"license.error.empty" = "Lizenzschlüssel darf nicht leer sein";
"license.error.storage" = "Lizenzschlüssel konnte nicht gespeichert werden";
"license.error.invalid_key" = "Ungültiger Lizenzschlüssel";
"license.error.network" = "Netzwerkfehler bei der Verifizierung";
"license.error.unknown" = "Unbekannter Fehler aufgetreten";
"license.error.invalid_url" = "Ungültige Verifizierungs-URL";
"license.error.invalid_response" = "Ungültige Server-Antwort";
"license.error.http_error" = "HTTP-Fehler: %d";
"license.error.invalid_json" = "Ungültiges Antwortformat";

"license.prompt.title" = "Lizenzschlüssel eingeben";
"license.prompt.subtitle" = "Bitte geben Sie Ihren Proxly-Lizenzschlüssel ein, um fortzufahren";
"license.prompt.placeholder" = "Lizenzschlüssel eingeben";
"license.prompt.verify_button" = "Lizenz verifizieren";
"license.prompt.quit_button" = "Beenden";
"license.prompt.retry_button" = "Wiederholen";

"license.onboarding.title" = "Willkommen bei Proxly";
"license.onboarding.subtitle" = "Lizenzverifizierung";
"license.onboarding.description" = "Um Proxly zu verwenden, geben Sie bitte Ihren Lizenzschlüssel ein. Falls Sie noch keinen haben, können Sie einen auf unserer Website erwerben.";

"license.prompt.input.label" = "Lizenzschlüssel";
"license.prompt.input.placeholder" = "Lizenzschlüssel eingeben";
"license.prompt.button.verify" = "Lizenz verifizieren";
"license.prompt.button.purchase" = "Lizenz kaufen";
"license.prompt.app_store.notice" = "Dies ist eine App Store-Version. Lizenzverifizierung ist nicht erforderlich.";

"license.prompt.input.accessibility.label" = "Lizenzschlüssel-Eingabefeld";
"license.prompt.input.accessibility.hint" = "Geben Sie hier Ihren Proxly-Lizenzschlüssel ein";
"license.prompt.status.accessibility.label" = "Lizenzverifizierungsstatus";
"license.prompt.button.verify.accessibility.label" = "Lizenz verifizieren-Schaltfläche";
"license.prompt.button.verify.accessibility.hint" = "Tippen Sie, um den eingegebenen Lizenzschlüssel zu verifizieren";
"license.prompt.button.purchase.accessibility.label" = "Lizenz kaufen-Schaltfläche";
"license.prompt.button.purchase.accessibility.hint" = "Tippen Sie, um die Kaufseite für Proxly zu öffnen";
"license.prompt.app_store.accessibility.label" = "App Store-Version-Hinweis";

// MARK: - Onboarding License Page
"onboarding.license.title" = "Willkommen bei Proxly";
"onboarding.license.subtitle" = "Um zu beginnen, verifizieren Sie bitte Ihren Lizenzschlüssel oder kaufen Sie Proxly.";
"onboarding.license.input.label" = "Lizenzschlüssel";
"onboarding.license.input.placeholder" = "Lizenzschlüssel eingeben";
"onboarding.license.button.verify" = "Lizenz verifizieren";
"onboarding.license.button.purchase" = "Lizenz kaufen";
"onboarding.license.app_store.notice" = "Sie verwenden die App Store-Version. Lizenzverifizierung ist nicht erforderlich.";
"onboarding.license.help.message" = "Benötigen Sie Hilfe? Kontaktieren Sie den Support oder prüfen Sie Ihre Kauf-E-Mail für Ihren Lizenzschlüssel.";

"onboarding.license.input.accessibility.label" = "Lizenzschlüssel-Eingabefeld";
"onboarding.license.input.accessibility.hint" = "Geben Sie Ihren Proxly-Lizenzschlüssel ein, um fortzufahren";
"onboarding.license.status.accessibility.label" = "Lizenzverifizierungsstatus";
"onboarding.license.button.verify.accessibility.label" = "Lizenz verifizieren-Schaltfläche";
"onboarding.license.button.verify.accessibility.hint" = "Den eingegebenen Lizenzschlüssel verifizieren";
"onboarding.license.button.purchase.accessibility.label" = "Lizenz kaufen-Schaltfläche";
"onboarding.license.button.purchase.accessibility.hint" = "Kaufseite für Proxly öffnen";
"onboarding.license.app_store.accessibility.label" = "App Store-Versions-Hinweis";
"onboarding.license.help.accessibility.label" = "Lizenz-Hilfsinformationen";

"onboarding.page.license.label" = "Lizenzverifizierungsseite";
"onboarding.page.license.hint" = "Proxly-Lizenzschlüssel eingeben und verifizieren";

"Licensed copy" = "Lizensierte Kopie";